In [19]:
import pandas as pd

In [20]:
info={
    "Name":["Rahul","Harsh","Navya"],
    "CGPA":[9.5,7.5,8.5]
}
df=pd.DataFrame(info)
print(df)

    Name  CGPA
0  Rahul   9.5
1  Harsh   7.5
2  Navya   8.5

In [21]:
df

    Name  CGPA
0  Rahul   9.5
1  Harsh   7.5
2  Navya   8.5

In [22]:
s=pd.Series([1,2,3,4,5])
print(s)
print(type(s))

#index
print(s[0])
print(s[1])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
2

In [25]:
s=pd.Series([21,42,33,14,75,"abc"],index=["Ayush","Nikhil","Vignesh","Aryan","Siddhant",25])
print(s)

print(s["Ayush"])
print(s.index)

Ayush        21
Nikhil       42
Vignesh      33
Aryan        14
Siddhant     75
25          abc
dtype: object
21
Index(['Ayush', 'Nikhil', 'Vignesh', 'Aryan', 'Siddhant', 25], dtype='object')

In [29]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([6,8,7,9,10])
print(s1+s2)

s1[0]=100
changed_s1=s1.drop(0)
print(s1)
print(changed_s1)

0     7
1    10
2    10
3    13
4    15
dtype: int64
0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [36]:
#dataframes

info={
    "Name":["Ayush","Dubey","Vigoo"],
    "Age":[23,24,25],
    "GPA":[9.0,7.9,9.5]
}
df=pd.DataFrame(info)
print(df,type(df))

print(df.index)
print(df.columns)

    Name  Age  GPA
0  Ayush   23  9.0
1  Dubey   24  7.9
2  Vigoo   25  9.5 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'GPA'], dtype='object')

In [39]:
df=pd.DataFrame([["Ayush",23],["Vignesh",22],["Siddhant",24]],columns=["Name","Age"])
print(df)

       Name  Age
0     Ayush   23
1   Vignesh   22
2  Siddhant   24

In [40]:
#creating dataframe using numpy
import numpy as np
np_arr=np.array([[1,2,3],[4,5,6]])
df=pd.DataFrame(np_arr,columns=["A","B","C"])
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [43]:
#csv data

df=pd.read_csv("employee_data.csv")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [46]:
#json data
df=pd.read_json("employee_data.json")
print(df,type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [60]:
#methods

# df.head() #starting 5 rows
# df.tail(2)

# df.sample(5)

# df.info()

# df.shape
df.describe()
df.columns
df.nunique()

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

In [47]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [64]:
#AQI data sets

df=pd.read_csv("global_air_quality_data.csv")
df.describe()

,PM2.5,PM10,NO2,SO2,CO,O3,Temperature,Humidity,Wind Speed
count,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.00000,10000.000000,10000.000000
mean,77.448439,104.438161,52.198649,25.344490,5.047984,106.031643,14.89715,55.078579,10.231636
std,41.927871,55.062396,27.320490,14.091194,2.852625,55.081345,14.44380,25.982232,5.632628
min,5.020000,10.000000,5.010000,1.000000,0.100000,10.040000,-10.00000,10.010000,0.500000
25%,41.185000,57.137500,28.347500,13.190000,2.560000,58.380000,2.25750,32.527500,5.290000
50%,77.725000,103.690000,52.100000,25.350000,5.090000,106.055000,14.75500,55.080000,10.260000
75%,113.392500,152.265000,75.705000,37.500000,7.480000,153.982500,27.38250,77.442500,15.070000
max,149.980000,200.000000,100.000000,49.990000,10.000000,200.000000,40.00000,99.990000,20.000000

In [101]:
#selecting the data

df["City"]
df[["City","Temperature"]]
#cols
df.loc[8999]
df.loc[0:2]  #start idx:end idx (inclusive)

#rows
df.iloc[2]
df.iloc[0:2] #start idx:end idx (exclusive)

df.loc[0:2,["City"]]
df.columns
df.loc[0:2,["Country","City","Date"]]
df.iloc[0:3,1:5]
# df.iloc[0:2,1]
# df.loc[0:2,["City","Temperature"]]

#cell
df.at[0,"City"]
df.iat[0,1]

cities=df["City"].copy()
cities[0]="Jamshedpur"
cities

0           Jamshedpur
1             Istanbul
2       Rio de Janeiro
3               Mumbai
4                Paris
             ...
9995      Johannesburg
9996            Berlin
9997            Moscow
9998            Berlin
9999           Bangkok
Name: City, Length: 10000, dtype: object

In [122]:
#filtering of data

df[df["Temperature"]>25]
df[(df["Temperature"]>25) & (df["PM10"]>100)]

df[df["Temperature"]>25][["City","Date"]]
temp_data=df[(df["Temperature"]>10) & (df["Temperature"]>20)][["City","Temperature"]]
temp_data
temp_data.iloc[0]
# temp_data.loc[0]

City           Rio de Janeiro
Temperature             25.29
Name: 2, dtype: object

In [126]:
#query
temp_value=10
df.query("Temperature>20 & `PM2.5`>100")[["City","Temperature"]] 
df.query("Temperature>@temp_value & `PM2.5`>100")[["City","Temperature"]]

                City  Temperature
2     Rio de Janeiro        25.29
3             Mumbai        23.15
5        Los Angeles        18.53
15             Paris        15.54
22            Sydney        27.42
...              ...          ...
9964     Mexico City        20.37
9968           Tokyo        37.80
9973         Beijing        19.45
9980         Bangkok        27.92
9991         Toronto        22.44

[2080 rows x 2 columns]

In [121]:
df

,City,Country,Date,PM2.5,PM10,NO2,SO2,CO,O3,Temperature,Humidity,Wind Speed
0,Bangkok,Thailand,2023-03-19,86.57,25.19,99.88,30.63,4.46,36.29,17.67,59.35,13.76
1,Istanbul,Turkey,2023-02-16,50.63,97.39,48.14,8.71,3.40,144.16,3.46,67.51,6.36
2,Rio de Janeiro,Brazil,2023-11-13,130.21,57.22,98.51,9.92,0.12,179.31,25.29,29.30,12.87
3,Mumbai,India,2023-03-16,119.70,130.52,10.96,33.03,7.74,38.65,23.15,99.97,7.71
4,Paris,France,2023-04-04,55.20,36.62,76.85,21.85,2.00,67.09,16.02,90.28,14.16
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,Johannesburg,South Africa,2023-09-16,147.85,184.34,90.33,34.93,2.81,191.45,-1.92,65.22,15.48
9996,Berlin,Germany,2023-12-05,12.22,121.49,49.04,5.66,2.10,184.56,-9.81,12.16,10.75
9997,Moscow,Russia,2023-11-26,44.07,143.62,8.41,32.58,0.69,167.68,39.35,53.95,4.56
9998,Berlin,Germany,2023-02-03,67.43,96.79,43.23,29.19,6.01,148.50,26.21,58.54,2.71
9999,Bangkok,Thailand,2023-06-13,16.34,28.80,50.48,21.20,0.49,17.41,2.50,66.05,5.01

In [149]:
#cleaing data missing values

df=pd.read_csv("raw_data.csv")
df.isnull()

df.isnull().sum()
df.dropna()
df.dropna(axis=1)
df.fillna(0)
age_mean=df["age"].mean()

cleaned_data=df.copy()
age_mean=cleaned_data["age"].mean()
cleaned_data["age"]=cleaned_data["age"].fillna(age_mean)
# cleaned_data

df.ffill()
df.bfill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [163]:
#handling duplicates

df[["country","gender"]].duplicated()
df2=df.copy()
df.drop_duplicates(inplace=True)

In [192]:
#data types

df.dtypes
df2=df.copy()
df2=df2.fillna(0)
df2["age"]=df2["age"].astype("int64").copy()
df2.dtypes


#handling strings
df["gender"].str.lower()
df["gender"].str.capitalize()
df["name"].str.split(" ")
df["country"].str.contains("uS",case=False)

0      True
2     False
3      True
4     False
5     False
6     False
7       NaN
8      True
9     False
10     True
Name: country, dtype: object

In [165]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [183]:
temp_data=pd.read_csv("global_air_quality_data.csv")
temp_data["Date"]=pd.to_datetime(temp_data["Date"])
temp_data["Date"].dtypes

dtype('<M8[ns]')

In [179]:
data_str=pd.Series([pd.to_datetime("2026-12-31")])
type(data_str.dtypes)

numpy.dtypes.DateTime64DType